import { TenderCard } from "@/entities/Tender";

const tender = {
    id: 159,
    name: "Детская одежда для оптовой продажи",
    ownerId: "aa474d84-e6a9-4809-9cf2-951a10bc9197",
    categoryId: 151,
    price: 100,
    currency: "RUB",
    minOrder: 100,
    minOrderUnits: "шт",
    bulkDiscounts: true,
    description: "Здравствуйте, мы производим детскую одежду для оптовой продажи. Производим домашние костюмы от 4 до 9 лет.Цена за 1 комплект 180 рублей. Шорты без карманов на резинке по 100 рублей за штуку. Футболки белые по 110 рублей за штуку.Имеется честный знак. Вся продукция сертифицирована. Мой номер телефона 89383090123. Если вам интересно звоните или пишите вотсап.",
    shareContacts: true,
    attachments: "[{\"key\":\"9f0d8411-3057-4122-956b-7450ffb9fa24.jpg\",\"name\":\"20240108_132730.jpg\"},{\"key\":\"54f1d24f-1225-4fe0-b3a4-10dff18a5183.jpg\",\"name\":\"20231117_123128.jpg\"},{\"key\":\"0fac6d95-403d-4da9-9d1b-ac8ce6f4b7ec.jpg\",\"name\":\"20231117_124040.jpg\"},{\"key\":\"c2ca90ed-bf0e-4522-8ae4-61d8aef8058e.jpg\",\"name\":\"20231117_124150.jpg\"},{\"key\":\"31adc63a-2bb4-4909-ba86-360d1dd4ce86.jpg\",\"name\":\"20231117_124242.jpg\"},{\"key\":\"297af195-769b-4440-82df-9bffe28b438f.jpg\",\"name\":\"20231117_124339.jpg\"},{\"key\":\"6d9d839b-7d54-44ca-a126-a2dccb17a9e5.jpg\",\"name\":\"20231117_124433.jpg\"},{\"key\":\"1c1c2c3b-3b3f-45e7-a228-c12578abf6cf.jpg\",\"name\":\"20231202_145730.jpg\"}]",
    createdAt: "03/01/2024 14:10:05"
}

const tenderPurchase = {
    id: 178,
    name: "Блузки, рубашки женские",
    ownerId: "6c8c4ba6-1f38-4319-beba-8918367811e2",
    categoryId: 151,
    quantity: 200,
    quantityUnits: "шт",
    maximumBudget: 1000,
    currency: "USD",
    description: "Рассматриваем предложения от потенциальных постоянных партнеров-производителей женской одежды в России и Беларуси. В приоритете - женские блузы, рубашки, туники, кардиганы (повседневные, офисные, нарядные). Бюджет и количество указаны для пробных партий в предложениях. Перспектива - постоянная основа и фулфилмент. Рост объемов. Самыми важными критериями при отборе партнера для нас является: предложенная цена, качество изготавливаемой продукции, модели одежды.",
    shareContacts: true,
    attachments: "[]",
    createdAt: "02/11/2024 07:19:59"
}

export default function MainPage() {
    return (
        <div>
            <TenderCard tender={tenderPurchase}/>
      
        </div>
    )
}
